{
	"navbar": {
		"logo": {
			"link": "#header",
			"logo": "LOGO"
		},
		"links": [
			{
				"text": "About",
				"link": "#about"
			},
			{
				"text": "Projects",
				"link": "#projects"
			},
			{
				"text": "Contacts",
				"link": "#contacts"
			},
			{
				"text": "Footer",
				"link": "#footer"
			}
		]
	},
	"header": {
		"suptitle": "Have passed this training",
		"title": "Track: Frontend Developer",
		"line": [
			"41k already learning",
			"6 projects",
			"80 hours",
			"154 topics"
		],
		"text": "Do you want to create your own websites or web applications? Choose this track to learn the most popular development tool suite among programmers around the world. We will cover the basics of JavaScript, HTML, and CSS to discover the power of modern Frontend development.",
		"btn": {
			"big": "Alredy done",
			"small": "click to see the result"
		}
	},
	"about": {
		"title": "Project-based learning with personal recommendations",
		"subtitle": "Learn programming while building complete applications",
		"text": "Learn with structured textual content. Apply your skills and create projects for your portfolio.",
		"image": "",
		"card": {
			"text": "Your learning is driven by a practical goal set by the project. This way you can see how tool and concepts are applied in the real life.",
			"bold": "Benefit from our recommendations that adjust to your level or choose a project out of 6 projects of varying complexity.",
			"list": [
				"Easy projects if you're just starting.",
				"Medium projects to build upon the basics.",
				"Hard projects to practice all the basic concepts and learn new ones.",
				"Challenging projects to perfect your knowledge with challenging tasks."
			]
		}
	},
	"projects": {
		"title": "Graduate projects to verify the track",
		"subtitle": "Graduate projects contain core topics for this track. You have to apply core topics in project stages to verify your knowledge.",
		"suptext": "Your learning is driven by a practical goal set by the project. This way you can see how tool and concepts are applied in the real life.",
		"text": "Graduate projects, which you will be able to complete at the end of the track",
		"cards": [
			{
				"difficulty": 0,
				"title": "Case Converter",
				"text": {
					"short": " While implementing this project, you will work with basic HTML elements. Create event handlers for click events and work with strings in JavaScript. Find out how to generate files for downloading.",
					"full": "We work with texts quite often, and it's very sad when it turns out that the text should have been written in a different case. Instead of editing it, you can create a simple application that does the job for us."
				},
				"list": [
					"4,3",
					"Easy",
					"12h",
					"47 topics"
				]
			},
			{
				"difficulty": 1,
				"title": "Flashcards",
				"text": {
					"short": "Apart from getting a useful memory-aid application, you will learn the basics of HTML and CSS. You will see how these two technologies can help you build a simple web page with beautiful design.",
					"full": "If you are a beginner web developer, you need to know the basics of CSS and HTML. This project is great for those who need somewhere to start. Your goal is to create a stylized page with flashcards, each containing a question on one side and the answer on the other. You can choose any subject you want for your flashcards!"
				},
				"list": [
					"4,3",
					"Medium",
					"17h",
					"62 topics"
				]
			},
			{
				"difficulty": 2,
				"title": "Virtual Piano",
				"text": {
					"short": "You will learn how to write HTML documents and work with the most popular CSS properties. You will also learn how to use JavaScript to make event handlers for browser events and create and insert new elements into documents.",
					"full": "One of the many things that a front-end developer has to take care of is binding the functionality of a web application to the keys on the keyboard. In order to develop and strengthen the important skills of working with keyboard keys, we will make a virtual piano in this project."
				},
				"list": [
					"4,4",
					"Hard",
					"16h",
					"74 topics"
				]
			},
			{
				"difficulty": 2,
				"title": "To-Do List",
				"text": {
					"short": "To complete the project, learn the basics of HTML, CSS, and JavaScript. You will work with several Javascript functions, loops, and objects. Learn how you can store the data in local storage.",
					"full": "Have you ever had the feeling that you're missing something important? If so, to-do lists can be of help. A clear outline of your daily tasks will help you stay composed and mentally focused. In this project, you will create a simple to-do list that can manage your tasks."
				},
				"list": [
					"4,3",
					"Hard",
					"22h",
					"74 topics"
				]
			},
			{
				"difficulty": 2,
				"title": "Open Space",
				"text": {
					"short": "The project covers the basics of JS, HTML, and CSS. You will learn how to position and design elements, work with different inputs, and even create animation using JS.",
					"full": "Have you ever dreamt about exploring deep space? In this project, you'll create a simple web game where you launch a rocket from an uninhabited planet. You don't have to be a rocket scientist to complete this project: we will start from the ground up by learning how to implement an HTML skeleton of a page and use CSS. Then, we'll learn how to make the game interactive with JS, and by the end of the project, you'll have a firm knowledge foundation for developing your frontend skills."
				},
				"list": [
					"4,4",
					"Hard",
					"24h",
					"81 topics"
				]
			},
			{
				"difficulty": 3,
				"title": "Portfolio",
				"text": {
					"short": "You will learn how to make your site adaptable to different screen sizes and browser versions. In the process, you will build your confidence in working with HTML.",
					"full": "A good way to make yourself known in the world of programming is to create a portfolio. It is really good when all of your impressive achievements, skills, and samples are collected in one place. If you know the basics of HTML, CSS, and JavaScript, you can even publish your portfolio on the website you created yourself! This project is a great way to present yourself as a specialist. You will write a one-page site with its own design and interactive elements."
				},
				"list": [
					"4,4",
					"Challenging",
					"24h",
					"90 topics"
				]
			}
		]
	},
	"contacts": {
		"links": {
			"large": {
				"text": "Find out more about JetBrain Academy",
				"link": "https://www.jetbrains.com/academy/"
			},
			"small": {
				"text": "Explore all learning tracks",
				"link": "https://hyperskill.org/tracks"
			}
		}
	},
	"footer": {
		"link": "https://github.com/mrKlava",
		"linkText": "mr.klava",
		"text": "made by"
	}
}